{
  "properties": [
    {
      "id": 1,
      "type": "house",
      "title": "Luxury Villa in Colombo 7",
      "price": 75000000,
      "bedrooms": 4,
      "bathrooms": 3,
      "area": 2500,
      "postcode": "CO7",
      "dateAdded": "2024-12-28",
      "description": "Beautiful luxury villa with modern amenities",
      "longDescription": "Myla Villa - Colombo 7 is a luxurious urban retreat blending modern design with traditional Sri Lankan elements. Located in the prestigious Colombo 7 area, it offers a tranquil haven with stunning views of the city and lush greenery. The villa features four air-conditioned bedrooms with ocean-view balconies, spacious living areas, a private infinity pool, a games room, a media room, and a fully equipped kitchen. Key amenities include free Wi-Fi, satellite TV, a stereo system, and a book library. The villa provides personalized services like a private chef, villa manager, housekeepers, butlers, and 24/7 security. Guests can also enjoy airport transfers, spa services, and groceries at cost. It’s the perfect blend of urban luxury, comfort, and Sri Lankan hospitality, ideal for both relaxation and city exploration.",

      "images": [
        "/images/prop1/house1-1.jpg",
        "/images/prop1/house1-2.jpg",
        "/images/prop1/house1-3.jpg",
        "/images/prop1/house1-4.jpg",
        "/images/prop1/house1-5.jpg",
        "/images/prop1/house1-6.jpg"
      ],
      "floorPlan": "/images/prop1/floorplan1.jpg",
      "location": {
        "lat": 6.906073,
        "lng": 79.869164
      }
    },
    {
      "id": 2,
      "type": "flat",
      "title": "Modern Apartment in Nugegoda",
      "price": 35000000,
      "bedrooms": 2,
      "bathrooms": 2,
      "area": 1200,
      "postcode": "NU1",
      "dateAdded": "2024-12-29",
      "description": "Contemporary apartment with city views",
      "longDescription": "This stylish and contemporary 2-bedroom, 2-bathroom apartment offers a perfect blend of comfort and convenience, situated in the vibrant heart of Nugegoda. With a spacious 1200 sqft open-plan design, the apartment is bathed in natural light, offering a seamless flow between the living, dining, and kitchen areas. The high-quality finishes throughout the space elevate the living experience, with sleek countertops, modern fixtures, and premium flooring. The bedrooms are designed to offer a peaceful retreat, each featuring ample closet space and large windows that frame breathtaking city views. The bathrooms are beautifully appointed with contemporary fittings, providing both functionality and luxury. Key amenities include air conditioning, high-speed internet, and a smart home system that adds an extra level of comfort and convenience. The apartment is ideally located, with easy access to public transport, shopping, dining, and entertainment options, making it",
      "images": [
        "/images/prop2/flat1-1.jpg",
        "/images/prop2/flat1-2.jpg",
        "/images/prop2/flat1-3.jpg",
        "/images/prop2/flat1-4.jpg",
        "/images/prop2/flat1-5.jpg",
        "/images/prop2/flat1-6.jpg"
      ],
      "floorPlan": "/images/prop2/floorplan2.jpg",
      "location": {
        "lat": 6.867691,
        "lng": 79.888634
      }
    },
    {
      "id": 3,
      "type": "house",
      "title": "Family Home in Battaramulla",
      "price": 45000000,
      "bedrooms": 3,
      "bathrooms": 2,
      "area": 1800,
      "postcode": "BA1",
      "dateAdded": "2024-12-30",
      "description": "Spacious family home with garden",
      "longDescription": "This perfect family home offers a spacious living experience with a large garden, modern kitchen, and ample parking space. Located in a quiet and peaceful residential area, this 3-bedroom, 2-bathroom house spans 1800 sqft, providing ample room for family living. The modern kitchen is fully equipped, ideal for cooking and entertaining, while the open-plan living areas create a welcoming and airy atmosphere. The large garden is perfect for children to play, outdoor gatherings, or simply enjoying a peaceful moment. The home also offers convenient parking for multiple vehicles. Whether you're looking for a tranquil retreat or a practical family base, this house in Battaramulla is the perfect blend of comfort, style, and functionality.",
      "images": [
        "/images/prop3/house2-1.jpg",
        "/images/prop3/house2-2.jpg",
        "/images/prop3/house2-3.jpg",
        "/images/prop3/house2-4.jpg",
        "/images/prop3/house2-5.jpg",
        "/images/prop3/house2-6.jpg"
      ],
      "floorPlan": "/images/prop3/floorplan3.jpg",
      "location": {
        "lat": 6.898156,
        "lng": 79.920187
      }
    },
    {
      "id": 4,
      "type": "flat",
      "title": "Luxury Apartment in Rajagiriya",
      "price": 55000000,
      "bedrooms": 3,
      "bathrooms": 2,
      "area": 1500,
      "postcode": "RA1",
      "dateAdded": "2025-01-01",
      "description": "High-end apartment with modern amenities",
      "longDescription": "This luxurious apartment offers an elevated living experience with high ceilings, premium finishes, and access to exclusive amenities such as a pool and gym. The 3-bedroom, 2-bathroom apartment spans 1500 sqft, providing spacious living areas that are designed for both comfort and style. The high-end finishes throughout the apartment enhance its modern aesthetic, while large windows allow natural light to flood the space. Residents can enjoy a range of amenities including a refreshing swimming pool and a fully-equipped gym, making it perfect for those who appreciate luxury and convenience. Located in the sought-after area of Rajagiriya, this apartment is the ideal blend of urban sophistication and relaxation."
    ,
      "images": [
        "/images/prop4/flat2-1.jpg",
        "/images/prop4/flat2-2.jpg",
        "/images/prop4/flat2-3.jpg",
        "/images/prop4/flat2-4.jpg",
        "/images/prop4/flat2-5.jpg",
        "/images/prop4/flat2-6.jpg"
      ],
      "floorPlan": "/images/prop4/floorplan4.jpg",
      "location": {
        "lat": 6.909758,
        "lng": 79.892935
      }
    },
    {
      "id": 5,
      "type": "house",
      "title": "Beach House in Mount Lavinia",
      "price": 85000000,
      "bedrooms": 4,
      "bathrooms": 3,
      "area": 2200,
      "postcode": "ML1",
      "dateAdded": "2025-01-02",
      "description": "Beachfront property with stunning views",
      "longDescription": "This beautiful beachfront property offers direct access to the beach, spacious terraces, and breathtaking panoramic ocean views. The 4-bedroom, 3-bathroom beach house spans 2200 sqft, providing an expansive living space designed for ultimate relaxation and luxury. The spacious terraces are perfect for outdoor dining, lounging, or simply enjoying the serene coastal surroundings. With large windows throughout, the house captures stunning ocean views from almost every room. Whether you're seeking a tranquil retreat or a perfect setting for entertaining, this beach house in Mount Lavinia combines natural beauty with modern comfort, offering a unique beachfront lifestyle.",
      "images": [
        "/images/prop5/house3-1.jpg",
        "/images/prop5/house3-2.jpg",
        "/images/prop5/house3-3.jpg",
        "/images/prop5/house3-4.jpg",
        "/images/prop5/house3-5.jpg",
        "/images/prop5/house3-6.jpg"
      ],
      "floorPlan": "/images/prop5/floorplan5.jpg",
      "location": {
        "lat": 6.839164,
        "lng": 79.862091
      }
    },
    {
      "id": 6,
      "type": "flat",
      "title": "City Apartment in Kollupitiya",
      "price": 65000000,
      "bedrooms": 2,
      "bathrooms": 2,
      "area": 1300,
      "postcode": "KO1",
      "dateAdded": "2025-01-03",
      "description": "Modern city apartment with sea view",
      "longDescription": "This stylish apartment, located in the heart of Colombo, offers stunning sea views, modern amenities, and 24-hour security. The 2-bedroom, 2-bathroom apartment spans 1300 sqft, featuring sleek and contemporary design throughout. Large windows provide breathtaking views of the ocean, while the open-plan living areas create a bright and welcoming atmosphere. The apartment is equipped with all the modern conveniences, including air conditioning, high-speed internet, and fully fitted kitchen. Residents also enjoy the peace of mind that comes with 24-hour security and easy access to Colombo’s shopping, dining, and entertainment options. This apartment in Kollupitiya combines city living with coastal tranquility, making it the ideal choice for a dynamic urban lifestyle."
,
      "images": [
        "/images/prop6/flat3-1.jpg",
        "/images/prop6/flat3-2.jpg",
        "/images/prop6/flat3-3.jpg",
        "/images/prop6/flat3-4.jpg",
        "/images/prop6/flat3-5.jpg",
        "/images/prop6/flat3-6.jpg"
      ],
      "floorPlan": "/images/prop6/floorplan6.jpg",
      "location": {
        "lat": 6.917053,
        "lng": 79.847855
      }
    },
    {
      "id": 7,
      "type": "house",
      "title": "Modern Villa in Dehiwala",
      "price": 95000000,
      "bedrooms": 5,
      "bathrooms": 4,
      "area": 3000,
      "postcode": "DE1",
      "dateAdded": "2025-01-04",
      "description": "Luxurious modern villa with pool",
      "longDescription": "This exceptional modern villa offers a luxurious living experience with a private pool, home theater, smart home systems, and beautifully landscaped gardens. The 5-bedroom, 4-bathroom villa spans 3000 sqft, providing an expansive and sophisticated living space. Designed with cutting-edge technology, the villa features a smart home system that enhances comfort and convenience, while the home theater offers the ultimate entertainment experience. The private pool and meticulously landscaped gardens create a tranquil oasis, ideal for both relaxation and hosting guests. With spacious bedrooms and modern bathrooms, this villa in Dehiwala combines contemporary design with luxury living, making it the perfect retreat for those who appreciate comfort, style, and privacy.",
      "images": [
        "/images/prop7/house4-1.jpg",
        "/images/prop7/house4-2.jpg",
        "/images/prop7/house4-3.jpg",
        "/images/prop7/house4-4.jpg",
        "/images/prop7/house4-5.jpg",
        "/images/prop7/house4-6.jpg"
      ],
      "floorPlan": "/images/prop7/floorplan7.jpg",
      "location": {
        "lat": 6.856300,
        "lng": 79.865461
      }
    }
  ]
}
